INVALID_JSON = 'Некорректный JSON.'

SUCCESS_BOOKED = ('Бронирование робота {} успешно. '
                  'Ожидайте звонка от нашего менеджера в ближайшее время')

ROBOT_SOLD = ('К сожалению робота {} в наличии нет. '
              'Вы получите уведомление на email, когда он появится.')

ORDER_PROCESS_ERROR = 'Произошла ошибка при обработке заказа.'

TYPE_ERROR = 'Некорректный тип данных. Принимается только строка'

REPEAT_ORDER = 'Вы уже забронировали этого робота.'

SUBJECT = 'Робот доступен'

MESSAGE = (
    'Добрый день!\n\n'
    'Недавно вы интересовались нашим роботом модели {}, версии {}.\n'
    'Этот робот теперь в наличии. '
    'Если вам подходит этот вариант - пожалуйста, свяжитесь с нами.'
)

UNSUCCESS_SEND_MAIL = 'Не удалось отправить письмо клиенту {}: {}'

NOT_SEND = 'Письмо не было отправлено.'

REQUIRED_FIELD = 'Обязательное поле.'
